CREATE TABLE type(
	id serial primary key,
	name varchar(255)
);

CREATE TABLE product(
	id serial primary key,
	name varchar(255),
	type_id int references type(id),
	expired_date date,
	price float
);

INSERT INTO type(name) VALUES ('СЫР'), ('МОЛОКО'), ('ФРУКТЫ'), ('МОРОЖЕНОЕ'), ('МАКАРОНЫ');
INSERT INTO product(name, type_id, expired_date, price) VALUES 
	('Российский сыр', 1, '2021-07-01', 155.55),
	('Пармезан', 1, '2021-07-16', 295),
	('Сыр Моцврелла', 1, '2021-08-01', 170),
	('Сыр ''Дор Блю''', 1, '2021-09-02', 241.25),
	('Домик в деревне %1.5', 2, '2021-08-01', 62),
	('Домик в деревне %2.5', 2, '2021-07-12', 67),
	('Parlamat %3.5', 2, '2021-08-25', 92),
	('Абрикос', 3, '2021-08-01', 255),
	('Авокадо', 3, '2021-08-02', 467),
	('Ананас', 3, '2021-09-01', 145),
	('Апельсины', 3, '2021-09-02', 100),
	('Персики', 3, '2021-06-29', 121),
	('Бананы', 3, '2021-07-15', 88),
	('Виноград', 3, '2021-07-18', 295),
	('Гранат', 3, '2021-08-01', 295),
	('Грейпфрут', 3, '2021-09-01', 155),
	('Груша', 3, '2021-07-23', 195),
	('Киви', 3, '2021-07-21', 188),
	('Лимоны', 3, '2021-08-04', 158),
	('Морожное MAXIBON', 4, '2022-01-15', 85),
	('Морожное Рожок', 4, '2021-12-01', 55),
	('Фруктовый лед Малина и садовая мята Paleta', 4, '2021-09-02', 162),
	('Паста ''De Cecco'' №101 Pappardelle', 5, '2023-02-01', 254),
	('Макаронные изделия Barilla Спагетти', 5, '2022-11-06', 54);